PRAGMA foreign_keys=OFF;
BEGIN TRANSACTION;
CREATE TABLE docs(
        id INTEGER PRIMARY KEY AUTOINCREMENT,
        name VARCHAR(30),
        surname VARCHAR(40),
        middle_name VARCHAR(30),
        full_name VARCHAR(100),
        place VARCHAR,
        specialty VARCHAR,
        schedule TEXT
        );
INSERT INTO docs VALUES(2,'Юрій','Гриценко','Вітольдович','Гриценко Юрій Вітольдович','2 корпус, 1 поверх, 91 кабінет','Фізіотерапевт',replace('Пн: 09:00 - 13:00 \nВт: 15:00 - 19:00 \nСр: 13:00 - 17:00 \nЧт: 10:00 - 14:00 \nПт: 12:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(3,'Степан','Попов','Святославович','Попов Степан Святославович','1 корпус, 1 поверх, 55 кабінет','Психіатр',replace('Пн: 12:00 - 17:00 \nВт: 10:00 - 15:00 \nСр: 09:00 - 14:00 \nЧт: 11:00 - 16:00 \nПт: 11:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(4,'Євген','Лапін','Володимирович','Лапін Євген Володимирович','3 корпус, 2 поверх, 57 кабінет','Геріатр',replace('Пн: 09:00 - 13:00 \nВт: 15:00 - 19:00 \nСр: 13:00 - 17:00 \nЧт: 10:00 - 14:00 \nПт: 12:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(5,'Євген','Шевченко','Максимович','Шевченко Євген Максимович','4 корпус, 2 поверх, 73 кабінет','Гінеколог-онколог',replace('Пн: 11:00 - 16:00 \nВт: 10:00 - 15:00 \nСр: 09:00 - 14:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(6,'Вадим','Орлова','Владиславович','Орлова Вадим Владиславович','2 корпус, 2 поверх, 101 кабінет','Протезувальник',replace('Пн: 11:00 - 16:00 \nВт: 09:00 - 11:00 \nСр: 10:00 - 15:00 \nЧт: 10:00 - 15:00 \nПт: 09:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(7,'Євген','Котенко','Андрійович','Котенко Євген Андрійович','2 корпус, 1 поверх, 71 кабінет','Нейрохірург',replace('Пн: 12:00 - 16:00 \nВт: 10:00 - 14:00 \nСр: 09:00 - 13:00 \nЧт: 13:00 - 17:00 \nПт: 13:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(8,'Наталя','Савченко','Валентинович','Савченко Наталя Валентинович','3 корпус, 1 поверх, 67 кабінет','Стоматолог',replace('Пн: 11:00 - 16:00 \nВт: 09:00 - 14:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(9,'Оксана','Литвиненко','Миронович','Литвиненко Оксана Миронович','4 корпус, 1 поверх, 103 кабінет','Кардіолог',replace('Пн: 10:00 - 14:00 \nВт: 09:00 - 12:00 \nСр: 14:00 - 18:00 \nЧт: 11:00 - 15:00 \nПт: 11:00 - 15:00 \n','\n',char(10)));
INSERT INTO docs VALUES(10,'Оксана','Левченко','Артемович','Левченко Оксана Артемович','4 корпус, 2 поверх, 73 кабінет','Трансплантолог',replace('Пн: 10:00 - 15:00 \nВт: 09:00 - 14:00 \nСр: 11:00 - 16:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(11,'Олександра','Даниленко','Ігорович','Даниленко Олександра Ігорович','5 корпус, 2 поверх, 26 кабінет','Гінеколог-онколог',replace('Пн: 12:00 - 16:00 \nВт: 10:00 - 14:00 \nСр: 09:00 - 13:00 \nЧт: 13:00 - 17:00 \nПт: 13:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(12,'Олег','Сидоров','Олексійович','Сидоров Олег Олексійович','3 корпус, 2 поверх, 77 кабінет','Онколог',replace('Пн: 12:00 - 17:00 \nВт: 10:00 - 15:00 \nСр: 09:00 - 14:00 \nЧт: 11:00 - 16:00 \nПт: 11:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(13,'Юрій','Козлов','Русланович','Козлов Юрій Русланович','2 корпус, 2 поверх, 81 кабінет','Офтальмолог',replace('Пн: 09:00 - 14:00 \nВт: 12:00 - 17:00 \nСр: 10:00 - 15:00 \nЧт: 11:00 - 16:00 \nПт: 11:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(14,'Сергій','Павленко','Олексійович','Павленко Сергій Олексійович','5 корпус, 2 поверх, 89 кабінет','Стоматолог',replace('Пн: 09:00 - 14:00 \nВт: 11:00 - 16:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(15,'Василь','Калініна','Сергієвич','Калініна Василь Сергієвич','1 корпус, 2 поверх, 10 кабінет','Дієтолог',replace('Пн: 11:00 - 16:00 \nВт: 09:00 - 14:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(16,'Анатолій','Шевченко','Адамович','Шевченко Анатолій Адамович','3 корпус, 1 поверх, 47 кабінет','ЛОР-лікар',replace('Пн: 10:00 - 15:00 \nВт: 12:00 - 18:00 \nСр: 09:00 - 14:00 \nЧт: 11:00 - 16:00 \nПт: 11:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(17,'Софія','Орлова','Костянтинович','Орлова Софія Костянтинович','4 корпус, 1 поверх, 43 кабінет','Косметолог',replace('Пн: 09:00 - 14:00 \nВт: 11:00 - 16:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(18,'Анатолій','Дмитрієв','Артемівич','Дмитрієв Анатолій Артемівич','4 корпус, 3 поверх, 20 кабінет','Гематолог',replace('Пн: 10:00 - 14:00 \nВт: 09:00 - 12:00 \nСр: 14:00 - 18:00 \nЧт: 11:00 - 15:00 \nПт: 11:00 - 15:00 \n','\n',char(10)));
INSERT INTO docs VALUES(19,'Оксана','Макаренко','Миколайович','Макаренко Оксана Миколайович','3 корпус, 1 поверх, 87 кабінет','Нарколог',replace('Пн: 08:00 - 12:00 \nВт: 14:00 - 18:00 \nСр: 11:00 - 15:00 \nЧт: 09:00 - 13:00 \nПт: 10:00 - 14:00 \n','\n',char(10)));
INSERT INTO docs VALUES(20,'Тетяна','Миронюк','Єгорович','Миронюк Тетяна Єгорович','3 корпус, 2 поверх, 37 кабінет','Нефролог',replace('Пн: 09:00 - 14:00 \nВт: 10:00 - 15:00 \nСр: 13:00 - 18:00 \nЧт: 12:00 - 16:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(21,'Любов','Бондаренко','Романович','Бондаренко Любов Романович','5 корпус, 2 поверх, 69 кабінет','Вірусолог',replace('Пн: 12:00 - 17:00 \nВт: 10:00 - 15:00 \nСр: 09:00 - 14:00 \nЧт: 11:00 - 16:00 \nПт: 11:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(22,'Анатолій','Черненко','Трохимович','Черненко Анатолій Трохимович','4 корпус, 2 поверх, 53 кабінет','Пародонтолог',replace('Пн: 11:00 - 16:00 \nВт: 09:00 - 14:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(23,'Софія','Степанова','Михайлович','Степанова Софія Михайлович','2 корпус, 4 поверх, 96 кабінет','Торакальний хірург',replace('Пн: 11:00 - 15:00 \nВт: 09:00 - 13:00 \nСр: 12:00 - 16:00 \nЧт: 10:00 - 14:00 \nПт: 10:00 - 14:00 \n','\n',char(10)));
INSERT INTO docs VALUES(24,'Петро','Михайлов','Русланович','Михайлов Петро Русланович','4 корпус, 4 поверх, 48 кабінет','Ортопед',replace('Пн: 09:00 - 14:00 \nВт: 11:00 - 16:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(25,'Тетяна','Волков','Михеевич','Волков Тетяна Михеевич','1 корпус, 4 поверх, 14 кабінет','Нейрохірург',replace('Пн: 12:00 - 16:00 \nВт: 10:00 - 14:00 \nСр: 09:00 - 13:00 \nЧт: 13:00 - 17:00 \nПт: 13:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(26,'Анна','Савченко','Богданович','Савченко Анна Богданович','5 корпус, 5 поверх, 84 кабінет','Лікар з лікування біль',replace('Пн: 11:00 - 16:00 \nВт: 09:00 - 11:00 \nСр: 10:00 - 15:00 \nЧт: 10:00 - 15:00 \nПт: 09:00 - 16:00 \n','\n',char(10)));
INSERT INTO docs VALUES(27,'Микола','Кравченко','Ярославович','Кравченко Микола Ярославович','4 корпус, 2 поверх, 53 кабінет','Гастроентеролог',replace('Пн: 11:00 - 16:00 \nВт: 09:00 - 14:00 \nСр: 10:00 - 15:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(28,'Оксана','Іванов','Анатолійович','Іванов Оксана Анатолійович','1 корпус, 3 поверх, 12 кабінет','Гематолог',replace('Пн: 10:00 - 15:00 \nВт: 12:00 - 18:00 \nСр: 09:00 - 14:00 \nЧт: 11:00 - 16:00 \nПт: 11:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(29,'Віктор','Бєлова','Леонідович','Бєлова Віктор Леонідович','3 корпус, 3 поверх, 82 кабінет','Фізіотерапевт',replace('Пн: 09:00 - 14:00 \nВт: 10:00 - 15:00 \nСр: 13:00 - 18:00 \nЧт: 12:00 - 16:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(30,'Любов','Миронюк','Якович','Миронюк Любов Якович','1 корпус, 3 поверх, 50 кабінет','Ортодонт',replace('Пн: 10:00 - 15:00 \nВт: 09:00 - 14:00 \nСр: 11:00 - 16:00 \nЧт: 12:00 - 17:00 \nПт: 12:00 - 17:00 \n','\n',char(10)));
INSERT INTO docs VALUES(31,'гршг','по','рлл','по гршг рлл','77 корпус, 8 поверх, 9 кабінет','про','Пн: 6:7 - 7:7.Вт: 7:8 - 8:8.Ср: 78:8 - 8:8.Чт: 7:7 - 88:9.Пт: 9:9 - 9:9.');
CREATE TABLE patients(
         id INTEGER PRIMARY KEY AUTOINCREMENT,
         name VARCHAR(30),
         surname VARCHAR(40),
         middle_name VARCHAR(30),
         full_name VARCHAR(90),
         complaint VARCHAR,
         doc_full_name VARCHAR(90),
         registration_date TEXT,
         registration_time TEXT);
INSERT INTO patients VALUES(1,'Віктор','Комарова','Андріянович','Комарова Віктор Андріянович','залізодефіцитна анемія','Дмитрієв Анатолій Артемівич','2024-10-17','07:03:48');
INSERT INTO patients VALUES(2,'Віталіна','Шаповалова','Михеевич','Шаповалова Віталіна Михеевич','мієлома','Савченко Анна Богданович','2024-08-28','17:17:13');
INSERT INTO patients VALUES(5,'Любов','Мироненко','Тарасович','Мироненко Любов Тарасович','емфізема','Литвиненко Оксана Миронович','2025-01-22','11:04:00');
INSERT INTO patients VALUES(6,'Анна','Павленко','Олексійович','Павленко Анна Олексійович','гонорея','Волков Тетяна Михеевич','2026-01-06','17:54:39');
INSERT INTO patients VALUES(7,'Анатолій','Степанова','Васильович','Степанова Анатолій Васильович','панік-атака','Орлова Вадим Владиславович','2025-09-23','09:21:19');
INSERT INTO patients VALUES(8,'Валентин','Чередніченко','Родіонович','Чередніченко Валентин Родіонович','бронхіальна обструкція','Бондаренко Любов Романович','2025-03-08','02:22:44');
INSERT INTO patients VALUES(9,'Петро','Лисенко','Ігорович','Лисенко Петро Ігорович','міокардит','Черненко Анатолій Трохимович','2025-08-15','06:46:28');
INSERT INTO patients VALUES(10,'Сергій','Кузьміна','Костянтинович','Кузьміна Сергій Костянтинович','тендовагініт','Волков Тетяна Михеевич','2024-08-28','13:02:01');
INSERT INTO patients VALUES(11,'Тамара','Білоус','Вікторович','Білоус Тамара Вікторович','емфізема','Савченко Наталя Валентинович','2025-08-12','20:19:55');
INSERT INTO patients VALUES(12,'Ігор','Гончаренко','Олегович','Гончаренко Ігор Олегович','астма','Савченко Анна Богданович','2025-06-12','22:50:09');
INSERT INTO patients VALUES(14,'Валентина','Максимова','Михайлович','Максимова Валентина Михайлович','гіпертензія','Шевченко Анатолій Адамович','2024-06-26','10:35:03');
INSERT INTO patients VALUES(15,'Ірина','Федоренко','Єгорович','Федоренко Ірина Єгорович','гастрит','Орлова Вадим Владиславович','2024-09-06','06:15:58');
INSERT INTO patients VALUES(16,'Лілія','Савченко','Олексійович','Савченко Лілія Олексійович','туберкульоз','Волков Тетяна Михеевич','2026-02-03','08:47:44');
INSERT INTO patients VALUES(17,'Лариса','Бондаренко','Богданович','Бондаренко Лариса Богданович','морбілі','Миронюк Тетяна Єгорович','2025-05-24','11:28:15');
INSERT INTO patients VALUES(18,'Петро','Сергієнко','Ростиславович','Сергієнко Петро Ростиславович','скарлатина','Савченко Наталя Валентинович','2025-12-09','04:46:31');
INSERT INTO patients VALUES(19,'Тетяна','Чернова','Андріянович','Чернова Тетяна Андріянович','діабет','Орлова Софія Костянтинович','2024-07-04','02:30:51');
INSERT INTO patients VALUES(20,'Валерій','Кузьміна','Андрійович','Кузьміна Валерій Андрійович','ларингіт','Макаренко Оксана Миколайович','2026-04-15','08:05:18');
INSERT INTO patients VALUES(21,'Тамара','Бондаренко','Максимович','Бондаренко Тамара Максимович','варикозна хвороба','Козлов Юрій Русланович','2024-12-07','15:53:59');
INSERT INTO patients VALUES(22,'Сергій','Гаврилюк','Григорович','Гаврилюк Сергій Григорович','акне','Даниленко Євген Васильович','2025-03-08','06:40:55');
INSERT INTO patients VALUES(23,'Ірина','Бондаренко','Михеевич','Бондаренко Ірина Михеевич','паркинсонізм','Савченко Анна Богданович','2025-01-01','00:42:22');
INSERT INTO patients VALUES(24,'Людмила','Тимошенко','Богданович','Тимошенко Людмила Богданович','панік-атака','Макаренко Оксана Миколайович','2024-06-23','00:01:20');
INSERT INTO patients VALUES(25,'Марія','Носова','Григорович','Носова Марія Григорович','туберкульоз','Миронюк Тетяна Єгорович','2024-10-05','13:06:32');
INSERT INTO patients VALUES(26,'Сергій','Кузьміна','Васильєвич','Кузьміна Сергій Васильєвич','пневмонія','Орлова Вадим Владиславович','2025-02-14','08:51:36');
INSERT INTO patients VALUES(27,'Андрій','Кравченко','Михеевич','Кравченко Андрій Михеевич','діабет','Левченко Оксана Артемович','2025-09-07','08:24:59');
INSERT INTO patients VALUES(28,'Надія','Григорович','Вітольдович','Григорович Надія Вітольдович','гострий апендицит','Бєлова Віктор Леонідович','2024-07-10','18:46:57');
INSERT INTO patients VALUES(29,'Софія','Савченко','Вадимович','Савченко Софія Вадимович','опісторхоз','Левченко Оксана Артемович','2025-07-13','14:02:13');
INSERT INTO patients VALUES(30,'Яна','Кравець','Олексієвич','Кравець Яна Олексієвич','дерматит','Макаренко Оксана Миколайович','2025-04-11','19:22:37');
INSERT INTO patients VALUES(32,'Костя','Стрілецький','Едуардович','Стрілецький Костя Едуардович','голова','Сто Про Лікар','2024-05-1','12:30:00');
CREATE TABLE records(
         id INTEGER PRIMARY KEY AUTOINCREMENT,
         name VARCHAR(30),
         surname VARCHAR(40),
         middle_name VARCHAR(30),
         full_name VARCHAR(90),
         complaint VARCHAR,
         doc_full_name VARCHAR(90),
         registration_date TEXT,
         registration_time TEXT);
INSERT INTO records VALUES(6,'Анна','Павленко','Олексійович','Павленко Анна Олексійович','гонорея','Волков Тетяна Михеевич','2026-01-06','17:54:39');
INSERT INTO records VALUES(7,'Анатолій','Степанова','Васильович','Степанова Анатолій Васильович','панік-атака','Орлова Вадим Владиславович','2025-09-23','09:21:19');
INSERT INTO records VALUES(8,'Валентин','Чередніченко','Родіонович','Чередніченко Валентин Родіонович','бронхіальна обструкція','Бондаренко Любов Романович','2025-03-08','02:22:44');
INSERT INTO records VALUES(9,'Петро','Лисенко','Ігорович','Лисенко Петро Ігорович','міокардит','Черненко Анатолій Трохимович','2025-08-15','06:46:28');
INSERT INTO records VALUES(10,'Сергій','Кузьміна','Костянтинович','Кузьміна Сергій Костянтинович','тендовагініт','Волков Тетяна Михеевич','2024-08-28','13:02:01');
INSERT INTO records VALUES(11,'Тамара','Білоус','Вікторович','Білоус Тамара Вікторович','емфізема','Савченко Наталя Валентинович','2025-08-12','20:19:55');
INSERT INTO records VALUES(12,'Ігор','Гончаренко','Олегович','Гончаренко Ігор Олегович','астма','Савченко Анна Богданович','2025-06-12','22:50:09');
INSERT INTO records VALUES(14,'Валентина','Максимова','Михайлович','Максимова Валентина Михайлович','гіпертензія','Шевченко Анатолій Адамович','2024-06-26','10:35:03');
INSERT INTO records VALUES(15,'Ірина','Федоренко','Єгорович','Федоренко Ірина Єгорович','гастрит','Орлова Вадим Владиславович','2024-09-06','06:15:58');
INSERT INTO records VALUES(16,'Лілія','Савченко','Олексійович','Савченко Лілія Олексійович','туберкульоз','Волков Тетяна Михеевич','2026-02-03','08:47:44');
INSERT INTO records VALUES(17,'Лариса','Бондаренко','Богданович','Бондаренко Лариса Богданович','морбілі','Миронюк Тетяна Єгорович','2025-05-24','11:28:15');
INSERT INTO records VALUES(18,'Петро','Сергієнко','Ростиславович','Сергієнко Петро Ростиславович','скарлатина','Савченко Наталя Валентинович','2025-12-09','04:46:31');
INSERT INTO records VALUES(19,'Тетяна','Чернова','Андріянович','Чернова Тетяна Андріянович','діабет','Орлова Софія Костянтинович','2024-07-04','02:30:51');
INSERT INTO records VALUES(20,'Валерій','Кузьміна','Андрійович','Кузьміна Валерій Андрійович','ларингіт','Макаренко Оксана Миколайович','2026-04-15','08:05:18');
INSERT INTO records VALUES(21,'Тамара','Бондаренко','Максимович','Бондаренко Тамара Максимович','варикозна хвороба','Козлов Юрій Русланович','2024-12-07','15:53:59');
INSERT INTO records VALUES(22,'Сергій','Гаврилюк','Григорович','Гаврилюк Сергій Григорович','акне','Даниленко Євген Васильович','2025-03-08','06:40:55');
INSERT INTO records VALUES(23,'Ірина','Бондаренко','Михеевич','Бондаренко Ірина Михеевич','паркинсонізм','Савченко Анна Богданович','2025-01-01','00:42:22');
INSERT INTO records VALUES(24,'Людмила','Тимошенко','Богданович','Тимошенко Людмила Богданович','панік-атака','Макаренко Оксана Миколайович','2024-06-23','00:01:20');
INSERT INTO records VALUES(25,'Марія','Носова','Григорович','Носова Марія Григорович','туберкульоз','Миронюк Тетяна Єгорович','2024-10-05','13:06:32');
INSERT INTO records VALUES(26,'Сергій','Кузьміна','Васильєвич','Кузьміна Сергій Васильєвич','пневмонія','Орлова Вадим Владиславович','2025-02-14','08:51:36');
INSERT INTO records VALUES(27,'Андрій','Кравченко','Михеевич','Кравченко Андрій Михеевич','діабет','Левченко Оксана Артемович','2025-09-07','08:24:59');
INSERT INTO records VALUES(28,'Надія','Григорович','Вітольдович','Григорович Надія Вітольдович','гострий апендицит','Бєлова Віктор Леонідович','2024-07-10','18:46:57');
INSERT INTO records VALUES(29,'Софія','Савченко','Вадимович','Савченко Софія Вадимович','опісторхоз','Левченко Оксана Артемович','2025-07-13','14:02:13');
INSERT INTO records VALUES(30,'Яна','Кравець','Олексієвич','Кравець Яна Олексієвич','дерматит','Макаренко Оксана Миколайович','2025-04-11','19:22:37');
DELETE FROM sqlite_sequence;
INSERT INTO sqlite_sequence VALUES('docs',31);
INSERT INTO sqlite_sequence VALUES('patients',32);
INSERT INTO sqlite_sequence VALUES('records',31);
COMMIT;
